import temple1 from "../assets/Temple-1.jpg";
import temple2 from "../assets/Temple-2.jpg";
import temple3 from "../assets/Temple-3.jpg";
import temple4 from "../assets/Temple-4.jpg";
import temple5 from "../assets/Temple-5.jpg";
import temple6 from "../assets/Temple-6.jpg";
import temple7 from "../assets/Temple-7.jpg";

import Museum1 from "../assets/Museum-1.jpg";
import Museum2 from "../assets/Museum-2.jpg";
import Museum3 from "../assets/Museum-3.jpg";
import Museum4 from "../assets/Museum-4.jpg";
import Museum5 from "../assets/Museum-5.jpg";
import Museum6 from "../assets/Museum-6.jpg";

import art1 from "../assets/art-1.jpg";
import art2 from "../assets/art-2.jpg";
import art3 from "../assets/art-3.jpg";

import history1 from "../assets/history-1.jpg";
import history2 from "../assets/history-2.jpg";

import family1 from "../assets/family-1.jpg";
import family2 from "../assets/family-2.jpg";
import family3 from "../assets/family-3.jpg";
import family4 from "../assets/family-4.jpg";
import family5 from "../assets/family-5.jpg";
import family6 from "../assets/family-6.jpg";

export const nodes = [
  { id: "START", x: 492, y: 125 },
  { id: "A", x: 20, y: 865 },
  { id: "A1", x: 95, y: 855 },
  { id: "B", x: 190, y: 845 },
  { id: "C", x: 400, y: 810 },
  { id: "C1", x: 378, y: 710 },
  { id: "C2", x: 322, y: 710 },
  { id: "C3", x: 292, y: 726 },
  { id: "C4", x: 260, y: 714 },
  { id: "C5", x: 254, y: 732 },
  { id: "C6", x: 219, y: 728 },
  { id: "C7", x: 209, y: 721 },
  { id: "D", x: 500, y: 790 },
  { id: "D1", x: 508, y: 780 },
  { id: "D1.5", x: 495, y: 685 },
  { id: "D2", x: 493, y: 673 },
  { id: "D3", x: 493, y: 614 },
  { id: "D3.5", x: 493, y: 585 },
  { id: "D4", x: 493, y: 524 },
  { id: "D4.5", x: 493, y: 500 },
  { id: "D5", x: 493, y: 485 },
  { id: "D6", x: 492, y: 444 },
  { id: "E", x: 520, y: 787 },
  { id: "E1", x: 735, y: 755 },
  { id: "E2", x: 700, y: 760 },
  { id: "E3", x: 800, y: 745 },
  { id: "E4", x: 525, y: 857 },
  { id: "E5", x: 525, y: 927 },
  { id: "E6", x: 600, y: 917 },
  { id: "E7", x: 615, y: 863 },
  { id: "E8", x: 710, y: 843 },
  { id: "E9", x: 850, y: 812 },
  { id: "E10", x: 950, y: 790 },
  { id: "E11", x: 940, y: 740 },
  { id: "F", x: 895, y: 730 },
  { id: "G", x: 930, y: 700 },
  { id: "G1", x: 822, y: 579 },
  { id: "G2", x: 760, y: 495 },
  { id: "G3", x: 746, y: 480 },
  { id: "G4", x: 735, y: 460 },
  { id: "G5", x: 751, y: 520 },
  { id: "G6", x: 722, y: 521 },
  { id: "G7", x: 688, y: 555 },
  { id: "G8", x: 795, y: 550 },
  { id: "G9", x: 730, y: 610 },
  { id: "G10", x: 750, y: 630 },
  { id: "G11", x: 800, y: 425 },
  { id: "G12", x: 883, y: 645 },
  { id: "G13", x: 895, y: 660 },
  { id: "H", x: 979, y: 690 },
  { id: "I", x: 951, y: 560 },
  { id: "J", x: 952, y: 498 },
  { id: "K", x: 933, y: 480 },
  { id: "L", x: 914, y: 367 },
  { id: "L1", x: 1020, y: 305 },
  { id: "M", x: 811, y: 283 },
  { id: "M1", x: 547, y: 468 },
  { id: "M2", x: 682, y: 380 },
  { id: "N", x: 701, y: 203 },
  { id: "O", x: 690, y: 180 },
  { id: "P", x: 650, y: 168 },
  { id: "P1", x: 530, y: 448 },
  { id: "Q", x: 484, y: 168 },
  { id: "Q1", x: 600, y: 168 },
  { id: "Q2", x: 381, y: 168 },
  { id: "Q3", x: 486, y: 200 },
  { id: "Q4", x: 487, y: 250 },
  { id: "Q5", x: 488, y: 300 },
  { id: "Q6", x: 489, y: 330 },
  { id: "Q7", x: 489, y: 380 },
  { id: "R", x: 316, y: 173 },
  { id: "R1", x: 453, y: 450 },
  { id: "S", x: 305, y: 170 },
  { id: "T", x: 270, y: 280 },
  { id: "U", x: 239, y: 391 },
  { id: "U1", x: 429, y: 470 },
  { id: "U2", x: 195, y: 381 },
  { id: "U3", x: 129, y: 370 },
  { id: "V", x: 200, y: 515 },
  { id: "W", x: 161, y: 658 },
  { id: "W1", x: 370, y: 647 },
  { id: "W2", x: 368, y: 522 },
  { id: "W3", x: 458, y: 647 },
  { id: "W4", x: 464, y: 618 },
  { id: "W4.5", x: 464, y: 595 },
  { id: "W5", x: 462, y: 522 },
  { id: "X", x: 172, y: 732 },
  { id: "Y1", x: 622, y: 524 },
  { id: "Y2", x: 528, y: 526 },
  { id: "Y3", x: 530, y: 642 },
  { id: "Y4", x: 624, y: 645 },
  { id: "Y5", x: 628, y: 574 },
  { id: "Y6", x: 669, y: 546 },
  { id: "Y7", x: 530, y: 615 },
  { id: "Y8", x: 530, y: 588 },
  { id: "Y9", x: 628, y: 588 },
  { id: "Y10", x: 578, y: 588 },
  { id: "Y11", x: 532, y: 663 },
  { id: "Y12", x: 582, y: 663 },
  { id: "Y13", x: 532, y: 685 },
  { id: "Y14", x: 582, y: 685 },

  // Z
  { id: "Z1", x: 1135, y: 655 },
  { id: "Z2", x: 1120, y: 533 },
  { id: "Z3", x: 1076, y: 275 },
  { id: "Z4", x: 918, y: 138 },
  { id: "Z5", x: 713, y: 4 },
  { id: "Z6", x: 598, y: 6 },
  { id: "Z7", x: 479, y: 4 },
  { id: "Z8", x: 379, y: 2 },
  { id: "Z9", x: 237, y: 6 },
  { id: "Z10", x: 121, y: 231 },
  { id: "Z11", x: 58, y: 356 },
  { id: "Z12", x: 36, y: 515 },
  { id: "Z13", x: 7, y: 692 },
];

export const questPoints = [
  {
    id: "QP_START",
    x: 510,
    y: 140,
    attachTo: "START",
    order: 1,
  },
  {
    id: "QP_1",
    x: 509,
    y: 395,
    attachTo: "D5",
    order: 2,
  },
  {
    id: "QP_2",
    x: 400,
    y: 470,
    attachTo: "M",
    order: 3,
  },
  {
    id: "QP_3",
    x: 470,
    y: 610,
    attachTo: "W4.5",
    order: 4,
  },
  {
    id: "QP_4",
    x: 580,
    y: 590,
    attachTo: "V",
    order: 5,
  },
  {
    id: "QP_5",
    x: 515,
    y: 785,
    attachTo: "W",
    order: 6,
  },
  {
    id: "QP_6",
    x: 965,
    y: 805,
    attachTo: "A",
    order: 7,
  },
  {
    id: "QP_7",
    x: 800,
    y: 550,
    attachTo: "F",
    order: 8,
  },
  {
    id: "QP_8",
    x: 925,
    y: 420,
    attachTo: "H",
    order: 9,
  },
  {
    id: "QP_9",
    x: 735,
    y: 460,
    attachTo: "K",
    order: 10,
  },
  {
    id: "QP_10",
    x: 656,
    y: 555,
    attachTo: "M",
    order: 11,
  },
  {
    id: "QP_11",
    x: 610,
    y: 600,
    attachTo: "Q",
    order: 12,
  },
  {
    id: "QP_12",
    x: 637,
    y: 655,
    attachTo: "T",
    order: 13,
  },
  {
    id: "QP_13",
    x: 540,
    y: 670,
    attachTo: "T",
    order: 14,
  },
];

export const gpsMap = {
  // ========== ОСНОВНЫЕ ТОЧКИ ГРАФА ==========
  A: [57.769595, 40.912184],
  B: [57.768089, 40.914999],
  C: [57.766208, 40.919132],
  C1: [57.767297, 40.920634],
  C2: [57.767851, 40.919633],
  C3: [57.767952, 40.919193],
  C4: [57.768399, 40.918688],
  C5: [57.768419, 40.918195],
  C6: [57.76874, 40.917814],
  C7: [57.768854, 40.917696],
  D: [57.765228, 40.921097],
  D1: [57.765237, 40.921397],
  D2: [57.766349, 40.923575],
  D3: [57.766759, 40.924375],
  D4: [57.767671, 40.926236],
  D5: [57.767937, 40.926832],
  D6: [57.768238, 40.927577],
  E: [57.765089, 40.921384],
  F: [57.761669, 40.928468],
  G: [57.761529, 40.929775],
  G1: [57.763678, 40.930463],
  G2: [57.765273, 40.930974],
  G3: [57.76557, 40.931057],
  G4: [57.765738, 40.931159],
  H: [57.761156, 40.930741],
  I: [57.762543, 40.932868],
  J: [57.763049, 40.933982],
  K: [57.763386, 40.934029],
  L: [57.764639, 40.936016],
  M: [57.766457, 40.935886],
  N: [57.768309, 40.935747],
  O: [57.768675, 40.935886],
  P: [57.769126, 40.935635],
  Q: [57.770805, 40.93297],
  Q1: [57.769656, 40.934985],
  Q2: [57.771885, 40.931299],
  R: [57.772494, 40.93024],
  S: [57.772657, 40.930036],
  T: [57.772157, 40.927241],
  U: [57.771484, 40.924733],
  V: [57.77082, 40.921706],
  W: [57.769958, 40.918252],
  X: [57.769223, 40.916962],

  // Z точки (окраины)
  Z1: [57.75997, 40.933746],
  Z2: [57.761256, 40.935431],
  Z3: [57.763688, 40.940344],
  Z4: [57.766564, 40.940607],
  Z5: [57.769953, 40.940508],
  Z6: [57.771252, 40.938528],
  Z7: [57.77243, 40.936607],
  Z8: [57.773509, 40.934796],
  Z9: [57.774665, 40.931972],
  Z10: [57.774148, 40.925816],
  Z11: [57.773739, 40.92219],
  Z12: [57.772594, 40.918812],
  Z13: [57.771346, 40.915004],

  // ========== СТАРТОВАЯ ТОЧКА ==========
  START: [57.771139, 40.934234],

  // ========== ХРАМЫ ==========
  TEMPLE_KREMLIN: [57.7678, 40.9352],
  TEMPLE_SPAS: [57.7673, 40.9262],
  TEMPLE_SMOLENSK: [57.767, 40.934],
  TEMPLE_BOGOYAVLEN: [57.7672, 40.9345],
  TEMPLE_ILYA: [57.7701, 40.921],
  TEMPLE_VOSKRES: [57.7602, 40.9765],
  TEMPLE_ZNAMENIE: [57.7695, 40.922],

  // ========== КАЛИБРОВОЧНЫЕ ТОЧКИ ==========
  CALIB_1780685724814: [57.7712147, 40.9343396],
  CALIB_1780686606421: [57.7853513, 40.9463457],
  CALIB_1780686790128: [57.7802434, 40.9171936],
  CALIB_1780687132871: [57.7652904, 40.9219522],
  CALIB_1780688110099: [57.7609418, 40.9297143],
  CALIB_1780689413808: [57.7644769, 40.9310081],
  CALIB_1780689916145: [57.7727537, 40.92435],
};

export const edges = [
  { from: "A", to: "A1" },
  { from: "A1", to: "B" },
  { from: "B", to: "C" },
  { from: "C", to: "D" },
  { from: "C", to: "C1" },
  { from: "C1", to: "C2" },
  { from: "C2", to: "C3" },
  { from: "C3", to: "C4" },
  { from: "C4", to: "C5" },
  { from: "C5", to: "C6" },
  { from: "C6", to: "C7" },
  { from: "C7", to: "X" },
  { from: "D", to: "E" },
  { from: "D", to: "D1" },
  { from: "D1", to: "D1.5" },
  { from: "D1.5", to: "D2" },
  { from: "D1.5", to: "Y13" },
  { from: "D2", to: "D3" },
  { from: "D2", to: "Y11" },
  { from: "D3", to: "D3.5" },
  { from: "D4", to: "D3.5" },
  { from: "D4", to: "D4.5" },
  { from: "D5", to: "D6" },
  { from: "D5", to: "D4.5" },
  { from: "D6", to: "Q7" },
  { from: "E2", to: "E1" },
  { from: "E1", to: "E3" },
  { from: "E3", to: "F" },
  { from: "D1", to: "E4" },
  { from: "E4", to: "E5" },
  { from: "E5", to: "E6" },
  { from: "E6", to: "E7" },
  { from: "E7", to: "E8" },
  { from: "E8", to: "E2" },
  { from: "E8", to: "E9" },
  { from: "E9", to: "E10" },
  { from: "E10", to: "E11" },
  { from: "E11", to: "G" },
  { from: "E", to: "D1" },
  { from: "F", to: "G" },
  { from: "G", to: "H" },
  { from: "G", to: "G13" },
  { from: "G12", to: "G13" },
  { from: "G1", to: "G8" },
  { from: "G1", to: "G12" },
  { from: "G8", to: "G2" },
  { from: "G8", to: "G9" },
  { from: "G9", to: "G10" },
  { from: "G1", to: "I" },
  { from: "G2", to: "G3" },
  { from: "G2", to: "G5" },
  { from: "G5", to: "G6" },
  { from: "G6", to: "G7" },
  { from: "G3", to: "G4" },
  { from: "G4", to: "G11" },
  { from: "G11", to: "L" },
  { from: "H", to: "I" },
  { from: "I", to: "J" },
  { from: "J", to: "K" },
  { from: "K", to: "L" },
  { from: "L", to: "M" },
  { from: "L", to: "L1" },
  { from: "M", to: "N" },
  { from: "M", to: "M2" },
  { from: "M2", to: "M1" },
  { from: "N", to: "O" },
  { from: "O", to: "P" },
  { from: "P", to: "Q1" },
  { from: "P", to: "P1" },
  { from: "Q1", to: "Q" },
  { from: "Q", to: "Q2" },
  { from: "Q", to: "Q3" },
  { from: "Q3", to: "Q4" },
  { from: "Q4", to: "Q5" },
  { from: "Q5", to: "Q6" },
  { from: "Q6", to: "Q7" },
  { from: "Q", to: "START" },
  { from: "Q2", to: "R" },
  { from: "R", to: "S" },
  { from: "R", to: "R1" },
  { from: "S", to: "T" },
  { from: "T", to: "U" },
  { from: "U", to: "V" },
  { from: "U", to: "U1" },
  { from: "U", to: "U2" },
  { from: "U2", to: "U3" },
  { from: "V", to: "W" },
  { from: "V", to: "W2" },
  { from: "W", to: "X" },
  { from: "W", to: "W1" },
  { from: "W1", to: "W2" },
  { from: "W1", to: "W3" },
  { from: "W2", to: "W5" },
  { from: "W3", to: "W4" },
  { from: "W4", to: "W4.5" },
  { from: "W4.5", to: "W5" },
  { from: "W4", to: "D3" },
  { from: "W5", to: "D4" },
  { from: "X", to: "B" },
  { from: "Y", to: "Y1" },
  { from: "Y1", to: "Y2" },
  { from: "Y2", to: "Y8" },
  { from: "Y8", to: "Y7" },
  { from: "Y8", to: "Y10" },
  { from: "Y10", to: "Y9" },
  { from: "Y7", to: "Y3" },
  { from: "Y7", to: "D3" },
  { from: "Y3", to: "Y4" },
  { from: "Y3", to: "Y11" },
  { from: "Y11", to: "Y12" },
  { from: "Y12", to: "Y14" },
  { from: "Y13", to: "Y14" },
  { from: "Y4", to: "Y9" },
  { from: "Y9", to: "Y5" },
  { from: "Y5", to: "Y6" },
  { from: "Y5", to: "Y1" },
  { from: "Y6", to: "G3" },
  { from: "Y6", to: "G7" },
  { from: "Y1", to: "G4" },
  { from: "Y2", to: "D4" },
  // Z
  { from: "Z1", to: "H" },
  { from: "Z2", to: "I" },
  { from: "Z3", to: "L1" },
  { from: "Z4", to: "M" },
  { from: "Z5", to: "P" },
  { from: "Z6", to: "Q1" },
  { from: "Z7", to: "Q" },
  { from: "Z8", to: "Q2" },
  { from: "Z9", to: "R" },
  { from: "Z10", to: "T" },
  { from: "Z11", to: "U3" },
  { from: "Z12", to: "V" },
  { from: "Z13", to: "W" },
  // center
  { from: "M1", to: "P1" },
  { from: "P1", to: "R1" },
  { from: "R1", to: "U1" },
  { from: "D5", to: "M1" },
  { from: "D5", to: "P1" },
  { from: "D5", to: "R1" },
  { from: "D5", to: "U1" },
];

export const templePoints = [
  {
    id: "TEMPLE_KREMLIN",
    name: "Костромской Кремль",
    x: 770,
    y: 670,
    attachTo: "G11",
    order: 1,
  },
  {
    id: "TEMPLE_SPAS",
    name: "Церковь Спаса Всемилостивого в Рядах",
    x: 577,
    y: 630,
    attachTo: "Y9",
    order: 2,
  },
  {
    id: "TEMPLE_SMOLENSK",
    name: "Церковь Смоленской иконы Божией Матери",
    x: 195,
    y: 365,
    attachTo: "U2",
    order: 3,
  },
  {
    id: "TEMPLE_BOGOYAVLEN",
    name: "Собор Богоявления Господня",
    x: 144,
    y: 330,
    attachTo: "U3",
    order: 4,
  },
  {
    id: "TEMPLE_ILYA",
    name: "Церковь Илии Пророка на Русиной улице",
    x: 810,
    y: 442,
    attachTo: "G2",
    order: 5,
  },
];

export const allTemples = [
  {
    id: "TEMPLE_KREMLIN",
    name: "Костромской Кремль",
    shortDescription:
      "— это место, где можно увидеть восстановленный архитектурный ансамбль, который символизирует богатство и разнообразие культурного наследия России. Посетители могут подняться на колокольню, откуда открывается панорамный вид на город.",
    image: temple1,
    address: "ул. Чайковского, 10, Кострома",
    description:
      "*Нажимая на кнопку,выбранное место отобразиться на вашей карте и простроит маршрут.",
    mapId: "TEMPLE_KREMLIN",
  },
  {
    id: "TEMPLE_SPAS",
    name: "Церковь Спаса Всемилостивого в Рядах",
    shortDescription:
      "— пятиглавая православная церковь середины XVIII века, которая входит в ансамбль Торговых рядов города Кострома.",
    image: temple2,
    address: "ул. Красные Ряды, 2, Кострома",
    mapId: "TEMPLE_SPAS",
  },
  {
    id: "TEMPLE_SMOLENSK",
    name: "Церковь Смоленской иконы Божией Матери в Богоявленском-Анастасиином монастыре",
    shortDescription:
      "Храм является главным в Костромской епархии и самым древним из сохранившихся церковных строений обители. Он был возведен в 1559–65 гг. и предположительно расписан мастерами артели Гурия Никитина в середине XVII в.",
    image: temple3,
    address: "ул. Симановского, 26А, Кострома",
    mapId: "TEMPLE_SMOLENSK",
  },
  {
    id: "TEMPLE_BOGOYAVLEN",
    name: "Собор Богоявления Господня в Богоявленском-Анастасиином монастыре",
    shortDescription:
      "Ранее это было три монастыря: Богоявленский мужской, Крестовоздвиженский и Анастасиинский женский. Основателем первого считается старец Никита, ученик Преподобного Сергия. После пожара в 1847 г. мужской монастырь был упразднен и передан в ведение женского Крестовоздвиженского. Анастасиин монастырь был основан в XV веке первой женой Ивана Грозного Анастасией Романовной.",
    image: temple4,
    address: "ул. Симановского, 13, Кострома",
    mapId: "TEMPLE_BOGOYAVLEN",
  },
  {
    id: "TEMPLE_ILYA",
    name: "Церковь Илии Пророка на Русиной улице",
    shortDescription:
      "В XVII веке на месте двух деревянных церквей Илии Пророка и Рождества Христова возвели каменную пятиглавую церковь на высоком подклете. Во время Костромского пожара 1773 года на Ильинском храме сгорела крыша и обрушились каменная глава и своды, в огне погибли все церковные документы. После пожара древнее церковное здание было перестроено в стиле позднего барокко.",
    image: temple5,
    address: "Советская ул., 4",
    mapId: "TEMPLE_ILYA",
  },

  {
    id: "TEMPLE_VOSKRES",
    name: "Церковь Воскресения Христова на Дебре",
    shortDescription:
      " — единственный сохранившийся в Костроме посадский храм XVII века. Он был построен в середине XVII века, не позднее 1652 года",
    image: temple6,
    address: "ул. Нижняя Дебря, 37, Кострома",
    externalLink:
      "https://yandex.ru/maps/org/tserkov_voskreseniya_khristova_na_debre/1088348755/?ll=40.977487%2C57.760379&z=17",
  },
  {
    id: "TEMPLE_ZNAMENIE",
    name: "Церковь иконы Божией Матери Знамение",
    shortDescription:
      "Костромская церковь в честь иконы Божией Матери «Знамение» в архивных документах впервые упоминается в 1628 году.Знаменский храм, стоящий к югу от Воскресенского собора, был построен вскоре после него и использовался как «теплая» (зимняя) церковь.",
    image: temple7,
    address: "ул. Нижняя Дебря, 37Б, Кострома",
    externalLink:
      "https://yandex.ru/maps/org/znamenskaya_tserkov/1033238786/?ll=40.921233%2C57.769474&z=17",
  },
];

// Точки для музеев на карте
export const museumPoints = [
  {
    id: "MUSEUM_1",
    name: "Дом городского головы Г.Н. Ботникова ",
    x: 690,
    y: 390,
    attachTo: "M2",
    order: 1,
  },
  {
    id: "MUSEUM_2",
    name: "Музей сыра",
    x: 890,
    y: 640,
    attachTo: "G11",
    order: 2,
  },
  {
    id: "MUSEUM_3",
    name: "Костромской музей-заповедник, Военно-исторический музей",
    x: 423,
    y: 457,
    attachTo: "U1",
    order: 3,
  },
  {
    id: "MUSEUM_4",
    name: "Костромской музей-заповедник, Музей кукол",
    x: 1010,
    y: 290,
    attachTo: "A1",
    order: 4,
  },
  {
    id: "MUSEUM_5",
    name: "Музей сладостей Русские сласти",
    x: 905,
    y: 650,
    attachTo: "L1",
    order: 5,
  },
  {
    id: "MUSEUM_6",
    name: "Петровская игрушка",
    x: 95,
    y: 835,
    attachTo: "G13",
    order: 6,
  },
];

// Обновляем allMuseums, добавив mapId
export const allMuseums = [
  {
    id: "MUSEUM_1",
    name: "Дом городского головы Г.Н. Ботникова ",
    shortDescription:
      " — это частная коллекция предметов быта конца XIX — начала XX века. В музее воссоздана обстановка купеческого дома, убранство жилых и приёмных комнат, сервировка столов и небольшая галерея.Здесь можно увидеть антикварную мебель, посуду, утварь кухонную, женские и мужские штучки, картины и воссоздать дух эпохи. В музее проводятся экскурсии, довольно подробные, можно присоединиться к ним, а можно просто побродить и сфотографироваться самостоятельно.",
    image: Museum1,
    address: `просп. Мира, 5, Кострома\nБилеты: 400р`,
    description:
      "*Нажимая на кнопку,выбранное место отобразиться на вашей карте и простроит маршрут.",
    mapId: "MUSEUM_1",
  },
  {
    id: "MUSEUM_2",
    name: "Музей сыра",
    shortDescription:
      " — это место, где вы можете узнать много интересного о сыре и его производстве. Здесь вы найдете экспозиции, посвященные истории сыроделия, национальным особенностям продукта, технологии производства, вкусовым особенностям и забавным казусам.В музее проводятся экскурсии с дегустацией, а также интерактивные мероприятия для посетителей всех возрастов, такие как квест «Мышеловка» и «сырные сказки». Кроме того, в музее есть магазин, где можно купить сыры и другую продукцию.",
    image: Museum2,
    address: `ул. Чайковского, 19, Кострома\nБилеты: 690-990р`,
    mapId: "MUSEUM_2",
  },
  {
    id: "MUSEUM_3",
    name: "Костромской музей-заповедник, Военно-исторический музей",
    shortDescription:
      "Военно-исторический музей в Костроме расположен в здании бывшей гауптвахты и представляет собой пять залов, посвященных различным периодам военной истории.Здесь можно увидеть экспонаты, связанные с древней Русью, Первой мировой войной, советско-финской войной, Великой Отечественной войной, войной в Афганистане и современными военными событиями.",
    image: Museum3,
    address: `ул. Ленина, 1, Кострома\nБилеты: 250-350р`,
    mapId: "MUSEUM_3",
  },
  {
    id: "MUSEUM_4",
    name: "Костромской музей-заповедник, Музей кукол",
    shortDescription:
      " — это место, где можно проследить историю кукол от самых старинных до наших дней.Здесь представлены куклы из разных стран, в том числе Франции, Германии, США и СССР, а также частные коллекции из Перми и Санкт-Петербурга. Экскурсоводы рассказывают интересные факты об экспонатах и особенностях кукольного дела.",
    image: Museum4,
    address: `Советская ул., 41А, Кострома\nБилеты: 150-200р`,
    mapId: "MUSEUM_4",
  },
  {
    id: "MUSEUM_5",
    name: "Музей сладостей Русские сласти",
    shortDescription:
      "— это место, где вы можете погрузиться в историю русских сладостей и традиций чаепития. Во время экскурсии вы узнаете о появлении сладостей на Руси и Костромской земле, о чаепитии и некоторых русских обрядах. В музее представлены старинные предметы быта, которые использовались для приготовления сладостей нашими предками. Также здесь можно попробовать различные сладости, такие как пряники, пастила, зефир и другие.",
    image: Museum5,
    address: `ул. Чайковского, 19А, Кострома\nБилеты: 200-500р`,
    mapId: "MUSEUM_5",
  },
  {
    id: "MUSEUM_6",
    name: "Петровская игрушка",
    shortDescription:
      " это место, где вы можете узнать об истории и традициях глиняной игрушки, а также принять участие в мастер-классах по ее созданию.В музее представлены глиняные игрушки из разных регионов России, включая дымковскую, филимоновскую, гжельскую, балкарскую, карачунскую и каргапольскую. Вы также можете купить готовые игрушки или оставить свою работу на обжиг и покрытие глазурью.",
    image: Museum6,
    address: `ул. 1 Мая, 24, Кострома\nБилеты: 100-150р`,
    mapId: "MUSEUM_6",
  },
];

// Точки для искусства на карте
export const artPoints = [
  {
    id: "ART_1",
    name: "Костромской музей-заповедник, Художественный музей",
    x: 473,
    y: 330,
    attachTo: "Q6",
    order: 1,
  },
  {
    id: "ART_2",
    name: "Костромской музей-заповедник, Картинная галерея",
    x: 587,
    y: 698,
    attachTo: "Y14",
    order: 2,
  },
];

// Данные для слайдера искусства
export const allArt = [
  {
    id: "ART_1",
    name: "Костромской музей-заповедник, Художественный музей",
    shortDescription:
      "Этот художественный музей расположен в историческом здании, которое было открыто в 1909 году и построено специально для музея. Здание напоминает древнерусский терем с белокаменной резьбой и просторным вестибюлем с широкой парадной лестницей.В музее можно увидеть работы Саврасова, Поленова, Левитана, Шишкина, Айвазовского, Коровина, Кончаловского и других известных художников. Также в музее проводятся временные выставки.",
    image: art1,
    address: `просп. Мира, 5, Кострома\nБилеты: 250-350р`,
    description:
      "*Нажимая на кнопку,выбранное место отобразиться на вашей карте и простроит маршрут.",
    mapId: "ART_1",
  },
  {
    id: "ART_2",
    name: "Костромской музей-заповедник, Картинная галерея",
    shortDescription:
      "Этот художественный музей расположен в историческом здании, которое было открыто в 1909 году и построено специально для музея. Здание напоминает древнерусский терем с белокаменной резьбой и просторным вестибюлем с широкой парадной лестницей.В музее можно увидеть работы Саврасова, Поленова, Левитана, Шишкина, Айвазовского, Коровина, Кончаловского и других известных художников. Также в музее проводятся временные выставки.",
    image: art2,
    address: `улица Рыбные ряды, 3, городской округ Кострома`,
    mapId: "ART_2",
  },
  {
    id: "ART_3",
    name: "Центр русского художественного искусства",
    shortDescription:
      " это музей, где можно увидеть работы местных художников, а также посетить временные выставки. Посетители отмечают, что в музее есть постоянная экспозиция, которая включает в себя скульптуры и графику Владимира Смирного, а также выставку фарфора Марии Тепловой. Кроме того, в музее проводятся мастер-классы и экскурсии.",
    image: art3,
    address: `площадь Мира, 2, Кострома\nБилеты: 100-200р`,
    mapId: "ART_3",
  },
];

// Точки для истории на карте
export const historyPoints = [
  {
    id: "HISTORY_1",
    name: "Пожарная каланча",
    x: 420,
    y: 495,
    attachTo: "G11",
    order: 1,
  },
];

// Данные для слайдера истории
export const allHistory = [
  {
    id: "HISTORY_1",
    name: "Пожарная каланча",
    shortDescription:
      "— это одна из главных достопримечательностей города Костромы. Она была построена в 1824 году и с тех пор является символом города. Сейчас в здании находится музей, где можно узнать много интересного о работе пожарных в прошлом. Также здесь есть смотровая площадка, с которой открывается прекрасный вид на город и реку Волгу.",
    image: history1,
    address: `просп. Текстильщиков, 2, Кострома\nБилеты: 700р`,
    description:
      "*Нажимая на кнопку,выбранное место отобразиться на вашей карте и простроит маршрут.",
    mapId: "HISTORY_1",
  },
  {
    id: "HISTORY_2",
    name: "Собор Троицы Живоначальной в Троицком Ипатьевском монастыре",
    shortDescription:
      "Центром древнейшего из сохранившихся архитектурных ансамблей Костромы — Ипатьевского монастыря — является Троицкий собор. Примерно в 1560 году на средства Дмитрия Годунова был выстроен первый каменный храм обители, который согласно сведениям из Писцовой книги 1628 года был двустолпным, с приделами во имя апостола Филиппа и священномученика Ипатия. ",
    image: history2,
    address: "ул. Просвещения, 1",
    description:
      "Индивидуальная пешеходная экскурсия по ансамблю зданий Ипатьевского монастыря: Троицкой церкови, палатам Романовых, усыпальнице семьи Годуновых - стоит 2750 руб. Услуги гида включены в цену. Стоимость посещения выставочных залов - 170 руб.",
    mapId: "HISTORY_2",
    externalLink: "https://yandex.ru/maps/-/CPF6EMPV",
  },
];

// Точки для семейных мест на карте
export const familyPoints = [
  {
    id: "FAMILY_1",
    name: "Музей шоколада",
    x: 809,
    y: 302,
    attachTo: "G5",
    order: 1,
  },
  {
    id: "FAMILY_2",
    name: "Лепота",
    x: 565,
    y: 580,
    attachTo: "M2",
    order: 2,
  },
];

// Данные для слайдера семейных мест
export const allFamily = [
  {
    id: "FAMILY_1",
    name: "Музей шоколада ",
    shortDescription:
      "— это место, где вы можете узнать об истории шоколада и процессе его производства, а также попробовать различные виды шоколада и конфет. В музее представлена коллекция исторических оберток, фантиков и вкладышей, а также экспонаты, связанные с производством шоколада в дореволюционное время. Кроме того, в музее проводятся экскурсии и мастер-классы по изготовлению конфет.",
    image: family1,
    address: `ул. Свердлова, 28/12, Кострома\nБилеты: 500р`,
    description:
      "*Нажимая на кнопку,выбранное место отобразиться на вашей карте и простроит маршрут.",
    mapId: "FAMILY_1",
  },
  {
    id: "FAMILY_2",
    name: "Лепота",
    shortDescription:
      "-это место, в котором вам проведут незабываемые мастер классы а так же же вы сможете купить одежду, сувениры и подарки для себя и близких.",
    image: family2,
    address: "ул. Мелочные Ряды, 1, корп. Е, ряды Красные, Кострома",
    mapId: "FAMILY_2",
  },
  {
    id: "FAMILY_3",
    name: "Лосеферма",
    shortDescription:
      "— это лесопарк, где можно увидеть лосей в их естественной среде обитания.Посетители могут погладить и покормить животных, а также купить сувениры, связанные с лосями, и попробовать лосиное молоко. ",
    image: family3,
    address: `Костромская область, Красносельский район, Гридинское сельское поселение, деревня Сумароково\nБилеты: 150-250р
(наличные)`,
    externalLink: "https://yandex.ru/maps/-/CPF6uZM2",
  },
  {
    id: "FAMILY_4",
    name: "музей деревянного зодчества",
    shortDescription:
      "Как попасть в настоящую тихую деревеньку посреди городской суеты? В Костроме это сделать проще простого, надо лишь отправиться в Музей деревянного зодчества ",
    image: family4,
    address: `ул. Просвещения, 1Б\nБилеты: 300-400р`,
    externalLink: "https://yandex.ru/maps/-/CPF6uL~y",
  },
  {
    id: "FAMILY_5",
    name: "Интерактивный музей ювелирного искусства",
    shortDescription:
      "Знаете ли вы, что 90% ювелирных изделий в России родом из Красного-на-Волге? Если нет, обязательно поситете это место. — это место, где вы можете узнать все о ювелирном деле и даже принять участие в мастер-классах. Вы узнаете, как создаются ювелирные изделия, какие технологии используются и даже сможете сделать свои собственные монетки или изделия из скани.",
    image: family5,
    address: "Советская ул., 52, п. г. т. Красное-на-Волге\nБилеты: 60-350р",
    externalLink: "https://yandex.ru/maps/-/CPF6yVko",
  },
  {
    id: "FAMILY_6",
    name: "Костромской зоопарк",
    shortDescription:
      "Костромской зоопарк — это место, где можно увидеть разнообразных животных, таких как верблюды, ламы, северные олени, маралы, волки, лисы, рыси, пумы, пантеры, ягуары, а также лебедей и уток.",
    image: family6,
    address: "ул. Ленина, 175, Кострома\nБилеты: 150-350р",
    externalLink: "https://yandex.ru/maps/-/CPF6ZZ6T",
  },
];
